Repository: daoka/raccoonwallet-ios
Catalog: RaccoonWallet/Resources/*.lproj/localizable.strings
Languages: ja, th

# wallet_create_message_1
source: If you want to maintain your wallet, press the button in the bar above. It is not working in this page so please try later.
ja: ウォレットのメンテナンスをしたいときは、上に出てきたバーのボタンを押してみてください。 この画面では動作しないからあとで試してみてくださいね。
th: หากต้องการซ่อมบำรุง Wallet โปรดกดปุ่มที่แสดงขึ้นมา ไม่สามารถทดลองผ่านหน้าจอนี้ได้ กรุณาลองอีกครั้ง

# wallet_create_address_headline
source: Wallet address created this time
ja: 今回作成されたウォレットアドレス
th: นี่คือ Address ของ Wallet คุณ

# wallet_end_message
source: Creating a new Wallet is now completed. If you want to back up your wallet, please go to the lesson. n For those who wish to use Wallet now, please move on to "HOME" to skip the lesson.
ja: 以上でウォレットの新規作成作業は完了です。 このままウォレットのバックアップなどを行いたい人はレッスンに移動してくださいね。 とりあえず今のままで使い始めたい人は 「HOME」からスキップもできます。
th: การสร้าง Wallet เสร็จสมบูรณ์แล้ว หากคุณต้องการสำรองข้อมูล Wallet กรุณาไปต่อที่บทเรียนด้านการสำรองข้อมูล หากต้องการเริ่มใช้งาน สามารถกด "หน้าหลัก" เพื่อข้ามไปได้

# wallet_import_title
source: Import private key
ja: 秘密鍵のインポート
th: Import หรือ ลิงค์ Private Key

# wallet_import_message
source: Good day, our dearest cryptocoiner. Please type in your private key or scan the QR code. 2 Your account will be linked to Raccoon.
ja: こんにちは、親愛なるクリプトコイナー。 1. リンクしたい暗号通貨の秘密鍵を入力する。 もしくはQRコードを読み取りましょう。 2. あなたの暗号通貨アカウントをラクーンにリンクします。
th: สวัสดี ชาวคริปโต 1. ใส่ Private Key ของสกุลเงินที่คุณต้องการลิงค์ หรืออ่าน QR โค้ด 2. ลิงค์บัญชีของคุณกับ Raccoon

# wallet_invalid_key
source: Invalid private key
ja: 無効な秘密鍵です
th: Private Key ไม่ถูกต้อง

# wallet_login_name_title
source: Import Wallet name
ja: Walletの名前をインポート
th: ลิงค์ชื่อ Wallet

# wallet_login_name_message
source: Great! Your account has been linked successfully. Giving a name to the wallet would help you.
ja: グレイト！ アカウントのリンクが正常に行われました。 ウォレットに名前をつけると便利です。
th: ดีมาก! ลิงก์บัญชีสำเร็จแล้ว คุณจะสะดวกขึ้น เมื่อตั้งชื่อ Wallet ของคุณ

# wallet_login_end_title
source: Link completed.
ja: リンク完了
th: ลิงค์สำเร็จ

# wallet_login_end_message
source: Congratulations! You have done linking your Wallet to this account. If you want to change or add your Wallet, you can do so by Wallet bar to access management screen. If you could spare your time, we advise you to take Security Lesson. You will learn how to set up PIN and how to backup your Wallet.
ja: おめでとうございます！ 以上でリンク作業は完了しました。 ウォレットの変更や追加をしたい場合は、 ウォレットバーのボタンから管理画面に アクセスしてみてください。 もし時間があるなら、この後のセキュリティレッスンの受講をオススメします。PINコードの設定やウォレットのバックアップを行います。
th: ยินดีด้วย! การลิงค์เสร็จสมบูรณ์แล้ว หากคุณต้องการเปลี่ยนหรือเพิ่ม Wallet เข้าสู่หน้าจอการดูแล ด้วยปุ่มบน Wallet bar หากคุณมีเวลาเราขอแนะนำให้เข้าชมบทเรียนด้านความปลอดภัยหลังจากนี้ เพื่อตั้งรหัส PIN และสำรองข้อมูล Wallet

# wallet_settings_title
source: Set up wallet
ja: ウォレットの設定
th: ตั้งค่า Wallet

# wallet_settings_general
source: General settings
ja: 一般設定
th: ตั้งค่าทั่วไป

# wallet_settings_detail
source: Wallet detail
ja: ウォレットの詳細
th: รายละเอียด Wallet

# wallet_settings_address
source: Wallet address
ja: ウォレットのアドレス
th: Address ของ Wallet

# wallet_settings_backup
source: Back up Wallet
ja: ウォレットのバックアップ
th: สำรองข้อมูล Wallet

# wallet_settings_rename
source: Change wallet name
ja: ウォレットの名前を変更する
th: เปลี่ยนชื่อ Wallet

# wallet_settings_delete
source: Delete wallet
ja: ウォレットを削除
th: ลบ Wallet

# wallet_key_caution_title
source: About Private Key
ja: プライベートキー(秘密鍵)について
th: เกี่ยวกับคีย์ส่วนตัว (Private Key)

# wallet_key_caution_message
source: Private Key is the most significant thing, which you must secure it at all cost. Private Key controls all assets and account information - it can also be used to restore your Wallet. Therefore, everyone has to know this basic knowledge. Please do not lose your Private Key, and never tell others.
ja: プライベートキー（秘密鍵）はあなたのアカウント情報において最も重要であり、機密事項として注意して取り扱わなければなりません。 プライベートキーは、関連する資金と資産を制御し、あなたのアカウントを元に戻すために必要なものであり、この知識は誰もが身につける必要があります。 このプライベートキーは、決してなくさないようにしてください。 また絶対に外部に漏れないように注意して扱ってください。
th: คีย์ส่วนตัว (Private Key) เป็นข้อมูลที่สำคัญที่สุดในข้อมูลบัญชี Wallet ของคุณและต้องได้รับการจัดการอย่างรอบคอบเพราะเป็นข้อมูลลับ Private Key จำเป็นต่อการควบคุมเงินและสินทรัพย์ รวมถึงการเรียกคืนบัญชีของคุณ ดังนั้นความรู้นี้จะต้องให้ทุกคนเข้าใจก่อนใช้ Wallet โปรดอย่าลบ Private Key นี้ และต้องระวังอย่าให้เกิดการรั่วและสูญหายของข้อมูลนี้

# wallet_key_backup_title
source: Don't take a screen shot of your private key.
ja: スクリーンショットに撮るのは危険です。
th: Screen Shot หน้าจอนี้เป็นเรื่องอันตราย

# wallet_key_backup_message
source: Please write down on a paper or secure it on Password management App/Software
ja: 紙に書き留める、またはパスワード管理アプリ・ソフトウェアを使って厳重に保管してください。
th: ควรเขียนลงบนกระดาษหรือบันทึกในแอ็พพลิเคชั่น / หรือซอฟต์แวร์บันทึกรหัสผ่าน

# wallet_delete_caution_message
source: You are about to delete your Wallet. If you do not have Private Key, you will never be able to restore your data. Are you sure you want to continue?
ja: ウォレットを削除します。秘密鍵がないと復元できなくなります。 本当にウォレットを削除しますか？
th: คุณกำลังจะลบ Wallet คุณจะไม่สามารถเรียกคืนได้โดยไม่มี Private Key คุณแน่ใจที่จะทำรายการต่อ?

# wallet_detail_title
source: Wallet detail
ja: ウォレットの詳細
th: รายละเอียด Wallet

# wallet_detail_structure
source: Wallet configuration (m-of-n)
ja: ウォレット構成（m-of-n）
th: ส่วนประกอบ Wallet（m-of-n）

# wallet_detail_importance
source: Importance score
ja: 重要性スコア
th: คะแนนความสำคัญ

# wallet_detail_general
source: General Information
ja: 一般情報
th: ข้อมูลทั่วไป

# wallet_rename_title
source: Change wallet name
ja: ウォレット名変更
th: เปลี่ยนชื่อ Wallet

# wallet_rename_hint
source: Enter Wallet name
ja: ウォレットの名前を入力
th: ตั้งชื่อ Wallet

# wallet_go_home_caution1_title
source: Do you want to skip Security Lesson?
ja: セキュリティ対策をスキップしますか？
th: คุณต้องการข้ามบทเรียนด้านความปลอดภัยหรือไม่?

# wallet_go_home_caution1_message
source: You are about to skip the lesson how to set up PIN code and Private Key backup. We strongly advise you to secure your account by understanding Security issues but do you still want to continue to go HOME?
ja: PINコードの設定や、秘密鍵のバックアップなどを行うセキュリティ対策をスキップしようとしています。 セキュリティ対策はしっかりとしておくことをオススメしますが、それでもHOMEに行きますか？
th: คุณต้องการข้ามบทเรียนด้านความปลอดภัย วิธีการใช้งาน การสร้างรหัส PIN และวิธีการสำรองข้อมูล Wallet เราแนะนำให้คุณศึกษาระบบความปลอดภัยให้ดีก่อน แต่หากต้องการเริ่มใช้งานเลย กรุณายืนยันไปต่อที่ หน้าหลัก

# wallet_go_home_caution2_title
source: Roger that!
ja: 了解しました
th: เข้าใจแล้วนะ

# wallet_go_home_caution2_message
source: If you want to back up your Wallet or set up PIN code, you can always do so at Wallet bar or application setting in Menu bar. Also, you can take Security Lesson at anytime by go to Security in the application setting.
ja: もしウォレットのバックアップやPINコードを設定したくなったら、ウォレットバーやメニューのアプリ設定からいつでも行えます。 それにセキュリティレッスンもアプリ設定のセキュリティの項目から受講できるので参照してみてくださいね。
th: หากคุณต้องการตั้งค่าการสำรองข้อมูล Wallet หรือรหัส PIN คุณสามารถทำได้ที่ตั้งค่าในแอปพลิเคชัน หรือที่เมนูWallet หากคุณต้องการรับบทเรียนด้านความปลอดภัย ไปดูได้ที่การตั้งค่าความปลอดภัยของแอพ

# wallet_import_nano_password_title
source: Enter password
ja: パスワード入力
th: ใส่รหัสผ่าน

# wallet_import_nano_password_headline
source: Enter NanoWallet password
ja: NanoWalletのパスワードを入力
th: ใส่รหัสผ่าน NanoWallet

# wallet_import_nano_password_message
source: You are about to link the account from NanoWallet by reading QR code. To complete this process, you need to enter NanoWallet password.
ja: NanoWalletで生成したQRコードからNEMアカウントをリンクしようとしています。 この操作には、NanoWalletのパスワードの入力が必要です。
th: คุณพยายามลิงค์บัญชี NEM จาก QRโค้ด ที่สร้างโดย NanoWallet การดำเนินการนี้ต้องใช้รหัสผ่าน NanoWallet

# wallet_import_nano_password_hint
source: Enter password
ja: パスワードを入れてください
th: กรุณาใส่รหัสผ่าน

# common_message
source: Message
ja: メッセージ

# common_address
source: Address
ja: アドレス

# common_mosaic_gallery
source: Mosaic Gallery
ja: モザイクギャラリー

# donation_yuki_role
source: Engineer
ja: エンジニア

# donation_soma_role
source: Engineer
ja: エンジニア
