Repository: daoka/raccoonwallet-ios
Catalog: RaccoonWallet/Resources/*.lproj/localizable.strings
Languages: ja, th

# common_done
source: Complete
ja: 完了
th: เสร็จสิ้น

# common_success
source: SUCCESS
th: สำเร็จ

# common_coming_soon
source: Coming Soon!
th: จะมาเร็วๆ นี้ !

# common_privacy_policy_caution
source: Please check before using App.
ja: アプリの利用を開始する前に、ご確認ください。
th: กรุณาตรวจสอบก่อนที่คุณจะเริ่มใช้แอพ

# common_privacy_policy
source: Terms of Use and Privacy Policy
ja: 利用規約とプライバシーポリシー
th: เงื่อนไขการใช้งานและนโยบายการเก็บข้อมูลส่วนตัว

# common_security_lesson
source: Security Lesson
ja: セキュリティレッスン
th: บทเรียนด้านความปลอดภัย

# common_pin_settings
source: Set up PIN Code
ja: PINコードの設定
th: ตั้งรหัส PIN

# common_pin_retry
source: Incorrect PIN code. Please try again.
ja: PIN Codeが一致しません。 もう一度入力してください。
th: รหัส PIN ไม่ตรงกัน กรุณาใส่อีกครั้ง

# common_pin_registration_message_0
source: Let's set up PIN code to protect your application. Please key in 6 digit number. You will need to key in two times the same for the confirmation of your PIN code. ※ We strongly advise you to avoid using the repetitive digit number or key in your birth date from security perspective.
ja: アプリ本体を保護するためのPINコードを設定します。6桁のPINコードを入力してください。 確認のため二度入力します。 ※数字の繰り返しや誕生日などを含むコードはセキュリティの観点からおすすめしません。
th: ตั้งรหัส PIN เพื่อป้องกันแอพพลิเคชั่น โปรดใส่รหัส PIN 6 หลัก กรุณาใส่สองครั้งเพื่อยืนยัน * เพื่อความปลอดภัย ไม่แนะนำให้ใช้รหัสที่มีตัวเลขซ้ำๆกันหรือใช้วันเกิด เป็นต้น

# common_pin_registration_message_1
source: If you have forgotten your PIN code, you will never be able to access to your account no matter what, therefore please do not forget it. That said, your asset is still in your Wallet account. By this mean, you will lose your asset only when you have lost Private Key.
ja: このPINコードを忘れた場合、アプリの操作ができなくなります。忘れないようにしてください。ただしPINコードを忘れた場合でもウォレットのXEMが無くなるわけではありません。 アドレスごとの秘密鍵を紛失した場合のみ資産にアクセスできなくなります。
th: หากคุณลืมรหัส PIN นี้คุณจะไม่สามารถใช้แอพพลิเคชั่นได้ ห้ามลืมนะ แต่ถ้าเกิดลืมขึ้นมา ไม่ได้แปลว่า XEM ของ Wallet จะไม่หายไป แต่ถ้าคุณเกิดทำaddress รหัส Private Key หายไป คุณจะไม่สามารถดึงเงินมาใช้ได้อีก โปรดระมัดระวังให้ดีๆนะ

# common_pin_registration_complete
source: 6 digit PIN code has been set up successfully to secure App.
ja: アプリ本体を保護するための6桁のPINコードが設定されました。
th: คุณได้ตั้งค่ารหัส PIN 6 หลักสำหรับป้องกันแอพพลิเคชั่นเสร็จสิ้นแล้ว

# common_mosaic_list
source: Mosaics
ja: モザイク一覧
th: รายการ mosaic

# common_destination
source: Recipient
ja: 送り先
th: ไปยัง

# common_fee
source: Fee
ja: 手数料
th: ค่าธรรมเนียม

# common_amount
source: Amount
ja: 金額
th: จำนวนเงิน

# common_invalid_address
source: Invalid address
ja: 有効なアドレスではありません
th: Address ไม่ถูกต้อง

# common_message_input
source: Enter message
ja: メッセージを入力
th: ใส่ข้อความ

# common_backup
source: Backup
ja: バックアップ
th: สำรองข้อมูล

# common_delete
source: Remove
ja: 削除
th: ลบ

# common_public_key
source: Public key
ja: 公開鍵
th: คีย์สาธารณะ

# common_not_select
source: Not selected
ja: 未選択
th: ยังไม่ได้เลือก

# common_not_get
source: Not acquired
ja: 未取得
th: ยังไม่ได้รับ

# common_address_book
source: Friends list
ja: フレンドリスト
th: รายชื่อเพื่อน

# common_donation
source: Donation
ja: 寄付
th: บริจาค

# common_settings
source: Settings
ja: 設定
th: การตั้งค่า

# common_general
source: General
ja: 一般
th: ทั่วไป

# common_security
source: Security
ja: セキュリティ
th: ความปลอดภัย

# common_biometrics_enable_title
source: Setup access by fingerprint authentication
ja: %@によるアクセス設定
th: ตั้งค่าการเข้าด้วยลายนิ้วมือ

# common_biometrics_enable_message
source: You can unlock the application by fingerprint authentication. Please press OK to finish setup.
ja: %@を使用してアプリのロックを解除できるように設定できます。 OKを押すと、設定を完了します。
th: คุณสามารถตั้งค่าเพื่อปลดล็อกแอพโดยใช้การตรวจสอบลายนิ้วมือ กด OK เพื่อสิ้นสุดการตั้งค่า

# common_biometrics_enable_success_title
source: SUCCESS!
th: สำเร็จ!

# common_biometrics_enable_success_message
source: Setup log in by fingerprint authentication is completed.
ja: %@を使用したログインが設定されました。
th: ตั้งค่าเข้าสู่ระบบโดยใช้การตรวจสอบลายนิ้วมือสำเร็จ

# common_qr_import
source: Import QR code
ja: QRコードのインポート
th: ลิงค์ QR

# common_invalid_password
source: Incorrect password
ja: パスワードが一致しません
th: รหัสผ่านไม่ตรงกัน

# common_error_pin_not_set
source: Your PIN setup is uncompleted. Please set up your PIN first.
ja: PINの設定がまだのようですね。先にPINの設定をお願いできますか？
th: คุณยังไม่ได้ตั้งค่า PIN คุณสามารถตั้ง PIN ได้ตอนนี้หรือไม่?

# common_error_insufficient_balance
source: You don't have enough balance
ja: 残高が足りません
th: จำนวนเงินคงเหลือไม่เพียงพอ

# common_error_decode_message
source: Failed to unlock
ja: 解除に失敗しました
th: ไม่สามารถเผยแพร่ได้

# common_error_go_send_title
source: You cannot continue to Send screen
ja: 送信画面に移動できません
th: ไม่สามารถย้ายไปที่หน้าทำรายการโอน

# common_error_go_send_pin_message
source: You cannot continue to Send screen because no PIN code has been set up yet. Set up PIN from Settings tab before you send your crypto.
ja: PINが設定されていないため、送信画面に移動できません。 送金操作を行うには、設定からPINの設定を行ってください。
th: คุณไม่สามารถย้ายไปที่หน้าทำรายการโอน เนื่องจากคุณยังไม่มีตั้งค่ารหัส PIN เพื่อดำเนินการโอนเงินโปรดตั้งรหัส PIN จากที่หน้าการตั้งค่า

# common_error_go_send_pin_button
source: Move to setup PIN page
ja: PIN設定画面に移動する
th: ไปที่หน้าจอการตั้งค่า PIN

# common_error_go_send_no_wallet_message
source: You cannot continue to Send screen due to no Wallet has been selected. In order to continue to remit asset, you need to select Wallet.
ja: ウォレットが選択されていないため、送信画面に移動できません。 送金操作を行うには、ウォレットを選択してください。
th: คุณไม่สามารถย้ายไปที่หน้าจอการโอนเงิน เนื่องจากยังไม่ได้เลือก Wallet สำหรับดำเนินการโอนเงินกรุณาเลือก Wallet

# common_error_go_send_no_wallet_button
source: Continue to Wallet selection screen.
ja: ウォレット選択画面に移動する
th: ย้ายไปที่หน้าเลือก Wallet

# common_never_remind
source: Do not show again
ja: 再度表示させない
th: ไม่แสดงอีกครั้ง

# common_wallet_balance
source: Wallet balance
ja: ウォレット残高
th: จำนวนเงินคงเหลือ

# common_copy_to_clipboard
source: Copied to the clipboard
ja: クリップボードにコピーしました
th: คัดลอกไปยังคลิปบอร์ดแล้ว

# about_title
source: About This APP
th: เกี่ยวกับ App นี้

# about_app_concept
source: Raccoon is made by these pure three visions: reliable, UI is easy to use, and make cryptocurrency enjoyable than ever.
ja: 信頼性が高く、 使いやすいUIで、 暗号通貨をもっと楽しく。 ラクーンは、これら３つを目標に作られた暗号通貨ウォレットです。
th: เชื่อถือได้ เป็นUI ที่ใช้ง่าย ทำมาเพื่อให้โลกคริปโตมีความน่าสนุกเพิ่มขึ้น Raccoon เป็นกระเป๋าสตางค์สกุลเงินที่มีสามเป้าหมายดังนี้

# about_official_site
source: Official Website | raccoonwallet.com
ja: 公式サイト｜raccoonwallet.com
th: เว็บไซต์ทางการ | raccoonwallet.com

# about_discord
source: Official DISCORD Server | Link
ja: 公式DISCORDサーバー｜紹介リンク
th: เซิร์ฟเวอร์ DISCORD อย่างเป็นทางการ | ลิงก์แนะนำ

# about_open_source
source: Open Source License
ja: オープンソースライセンス
th: ใบอนุญาตโอเพนซอร์ส

# about_review
source: Write a review
ja: レビューを書く
th: เขียนรีวิว

# create_wallet_tutorial_title
source: Welcome!
ja: ようこそ！
th: ยินดีต้อนรับ！

# create_wallet_tutorial_message
source: Hello once again! Welcome to Raccoon Wallet. Before you start Raccoon, you need to prepare a wallet first. Please choose if you make a new wallet or import one.
ja: 改めまして、こんにちは。 ラクーンへようこそ。 さてこれからあなたがラクーンを始めるにあたって、まずはウォレットの準備をお願いしたいと思います。 次の画面で新しくウォレットを作るか、それともすでにブロックチェーンに登録済みのアカウントでログインするかを選んでいただけますか？
th: สวัสดีอีกครั้ง! ยินดีต้อนรับสู่ Raccoon ตั้งแต่นี้เป็นต้นไป คุณกำลังจะเริ่มใช้ Raccoon กรุณาเตรียม Wallet ให้พร้อม คุณสามารถเลือกที่จะสร้างกระเป๋าสตางค์ใหม่บนหน้าจอถัดไป หรือ ลิงค์เข้าบัญชี Wallet ที่มีอยู่แล้ว

# donation_title
source: Developers
ja: 開発者一覧
th: รายชื่อทีมงานสร้างแอป

# donation_detail_title
source: Profile
ja: プロフィール
th: โปรไฟล์

# donation_yuki_detail
source: エンジニア ・ベースアプリ開発 ・Android版アプリ開発
th: Engineer ・Base App Developer ・For Android App Developer

# donation_soma_detail
source: エンジニア ・Android版アプリ開発
th: Engineer ・For Android App Developer

# first_tutorial_button
source: Let's get started.
ja: はじめる
th: เริ่มต้น

# first_tutorial_title1
source: はじめまして
th: ยินดีต้อนรับ

# first_tutorial_title2
source: 信頼の革新を手のひらに
th: ความไว้วางใจของคุณอยู่ในมือเรา

# first_tutorial_title3
source: すべての人に経済を。
th: เศรษฐกิจเพื่อทุกๆคน

# first_tutorial_message1
source: Hi, I am glad to see you! Let us begin New Economy Movement by Blockchain together!
ja: お会いできて光栄です。 ブロックチェーンを使った新しい経済活動を 一緒にはじめましょう。
th: ยินดีต้อนรับทุกคน มาเริ่มกิจกรรมทางเศรษฐกิจใหม่ ที่ใช้บล็อกเชนด้วยกันเถอะ

# first_tutorial_message2
source: New Economy platform based on cryptocurrency and new ideas encourages you to have amazing experiences.
ja: すべてが暗号通貨ベースで設計され, すべてが新しい考え方で動く、 ニューエコノミープラットフォーム。 魅力的な体験は、ここから始まります。
th: ทุกอย่างได้รับการออกแบบด้วยพื้นฐานของสกุลเงินที่เข้ารหัสลับ ทุกอย่างเคลื่อนไหวด้วยแนวความคิดใหม่ๆ แพลตฟอร์มเศรษฐกิจใหม่ ประสบการณ์ที่น่าสนใจเริ่มต้นจากที่นี่

# first_tutorial_message3
source: New Economy Movement for liberty and co-creation is already here.
ja: 自由と共創の新経済が待っています。
th: เศรษฐกิจใหม่เพื่ออิสรภาพและการสร้างสรรค์กำลังรอคุณอยู่

# gallery_no_mosaic_title
source: No mosaics
ja: モザイクがありません
th: ไม่มี Mosaic

# gallery_no_mosaic_message
source: Currently, there is no mosaic to show here.
ja: お見せできるモザイクは、今のところないようです。
th: ไม่มี Mosaic ที่สามารถแสดงได้ในขณะนี้

# home_transaction_empty_message
source: No transactions yet.
ja: まだ送受信は されていないみたいです。
th: การส่ง/รับเงินยังไม่สำเร็จ

# home_harvest_empty_message
source: No harvesting income yet.
ja: まだハーベストの記録は ないようです。
th: ยังไม่มีบันทึก Harvesting

# lesson_introduction_message
source: Welcome aboard! Are you looking for Security Lesson ? Well, here it is! Let's get started. First of all, can you tell me about yourself by choosing one of the followings.
ja: ようこそいらっしゃいました！ セキュリティレッスンですね？ 特別にみなさんに最適なレッスン用意してあります！ 早速やっていきましょう。 それでは、まず最初にあなたのことを教えてくれますか？ 次の画面でご自分に合うものを選択してみてください。
th: ยินดีต้อนรับ! บทเรียนความปลอดภัยคืออะไร? บทเรียนพิเศษนี้เตรียมไว้สำหรับทุกคน! มาเริ่มกันเลยเถอะ จากนั้นกรุณาบอกเราเกี่ยวกับตัวคุณ กรุณาเลือกข้อมูลที่ตรงกับคุณในหน้าจอถัดไป

# lesson_level_beginner_title
source: Start Cryptocurrency by Raccoon
ja: ラクーンで暗号通貨を始めます
th: เริ่มเข้าสู่โลกคริปโต กับ Raccoon กันเถอะ

# lesson_level_beginner_setup
source: Back up Private Key + Set up PIN code
ja: 秘密鍵のバックアップ＋PINコードの設定
th: การสำรองคีย์ส่วนตัว หรือ Private Key + การตั้งรหัส PIN

# lesson_level_beginner_message
source: Welcome to Raccoon!
ja: ようこそラクーンへ！
th: ยินดีต้อนรับสู่ Raccoon !

# lesson_level_importer_title
source: Logged in by Private Key
ja: 秘密鍵からのログインです
th: เข้าสู่ระบบจาก Private Key

# lesson_level_importer_setup
source: Set up PIN Code
ja: PINコードの設定
th: ตั้งรหัส PIN

# lesson_level_importer_message
source: Thank you for choosing Raccoon.
ja: ラクーンを選んでいただき感謝します
th: ขอบคุณที่เลือกใช้ Raccoon

# lesson_level_expert_title
source: It is a Raccoon user.
ja: ラクーンユーザーです
th: เป็นผู้ใช้ Raccoon

# lesson_level_expert_setup
source: Back up Wallet
ja: ウォレットのバックアップ
th: สำรองข้อมูล Wallet

# lesson_level_expert_message
source: Thank you for staying loyal. It's a nice weather today.
ja: いつもありがとうございます。今日もいい天気ですね。
th: ขอบคุณทุกคนเสมอนะ วันนี้อากาศดีเนอะ

# lesson_beginner_message
source: For those who are about to start Crypto. First above anything, cryptocurrency has "Private Key," which is very significant. This Private Key is used to control your asset in the Wallet; it also be used to back up your Wallet in case you lose your devices or whatsoever. You might also need to set up PIN code to lock your application - just so you need to protect from fraud as well. Hence, we are going to give you lesson regarding to Private Key and PIN code setup. And now let's move on. Are you ready?
ja: これから暗号通貨をスタートするあなたへ。 まず暗号通貨にとって最も重要なものに”秘密鍵”というものがあります。 これは資産を管理するために必要で、絶対になくさないためにもバックアップが大切になってきます。 それからアプリ本体のPINコード。 スマホをもし落としてしまったりしたとき、アプリにロックをかけておかないと、勝手に送金されてしまうかもしれません。 これから、この２つを対策していきます。 準備はいいですか？
th: สำหรับคนที่จะเริ่มถือคริปโต ประการแรกสิ่งที่สำคัญที่สุดสำหรับสกุลเงินในการเข้ารหัสคือ "คีย์ลับ" หรือ Private Key ดังนั้นเพื่อไม่ให้ข้อมูลสูญหาย การสำรองข้อมูลจึงเป็นสิ่งสำคัญ แล้วก็รหัส PIN หลักของแอพพลิเคชั่น หากคุณลืมสมาร์ทโฟน โดยไม่ได้ตั้งรหัส PIN ล็อคไว้ คุณอาจสูญเสียทุกอย่างภายใน Wallet ได้ แต่มีวิธีแก้ไข ดังนั้นเราจะสอนให้คุณพร้อมรับสถานการณ์ คุณพร้อมแล้วหรือยัง?

# lesson_beginner_backup_end_message
source: Hello again! Have you done backup your Wallet already? Next, you set up PIN code for application. Wish you good luck!
ja: またお会いしましたね！ ウォレットのバックアップはできましたか？ さあ次は、アプリのPINコード設定です。 グッドラック！
th: เจอกันอีกแล้วนะ! คุณได้สำรอง Wallet หรือยัง? ถัดไปคือการตั้งค่ารหัส PIN ของแอพพลิเคชั่น โชคดีนะ!

# lesson_importer_message
source: For those who are already professional in cryptocurrency. Thank you for choosing Raccoon. Well, there might be nothing for you to learn from us. Please do setup PIN code from this screen. If you have forgotten to back up Private Key, you might want to take Security Lesson from beginner's guide.
ja: 暗号通貨に詳しいあなたへ。 Raccoonを選んでくれて嬉しいです。 すでに暗号通貨に詳しいあなたには、 こちらから説明することはあまりないかもしれませんね。 ここの画面から、PINコードの設定画面に移れますから、 設定をお願いします。 もし秘密鍵のバックアップを取り忘れてたなら、初心者のカードからレッスンを受けてくださいね。
th: สำหรับมือโปรอย่างคุณที่คุ้นเคยกับสกุลเงินดิจิตอล ดีใจนะที่คุณเลือกใช้ Raccoon สำหรับคนที่คุ้นเคยกับสกุลเงินอย่างคุณ เราอาจจะไม่ต้องอธิบายเพิ่มเติม จากหน้าจอนี้คุณสามารถย้ายไปที่หน้าจอการตั้งค่ารหัส PIN ได้ ดังนั้นโปรดตั้งค่า หากคุณลืมสำรอง Private Key คุณสามารถเรียนรู้ข้อมูลทุกอย่างจากได้จากผู้เริ่มใช้ครั้งแรก

# lesson_end_title
source: Good job!
ja: お疲れ様でした
th: ขอบคุณนะ

# lesson_beginner_end_message
source: Otsukaresama deshita m ( ) m n This is the end of Security Lesson. If you want to learn more, please take a look at Help at Menu section. We wish you a happy Crypto life!
ja: お疲れ様でした。 以上でセキュリティレッスンは終わりになります。 もし分からないことがあったら、メニューからヘルプを参照してみてくださいね。 あなたに良い暗号通貨ライフが訪れることを お祈りしています！
th: บทเรียนด้านความปลอดภัยจะเสร็จแล้ว หากคุณมีบางอย่างที่ไม่เข้าใจโปรดดูความช่วยเหลือจากเมนู ขออวยพรให้โชคดีกับไลฟ์สไตล์สกุลเงินลับนะ!

# lesson_importer_end_message
source: Otsukaresama deshita m ( ) m n This is the end of Security Lesson. You can learn how to use this Wallet by Help in Menu section. We wish you a happy Crypto life!
ja: お疲れ様でした。 以上でセキュリティレッスンは終わりになります。 このウォレット自体の使い方は、メニューからアクセスできるヘルプからアクセスできますので、参照してみてください。 あなたの暗号通貨ライフが これからも良いものであることをお祈りしています！
th: บทเรียนด้านความปลอดภัยเสร็จแล้วนะ หากคุณไม่เข้าใจการใช้งานโปรดดูความช่วยเหลือจากเมนู ขออวยพรให้โชคดีกับไลฟ์สไตล์สกุลเงินลับนะ!

# lesson_expert_end_message
source: Thank you for using Raccoon. So this is the end of Security Lesson. We hope you continue enjoying crypto life.
ja: いつもラクーンを使っていただき ありがとうございます。 以上でセキュリティレッスンは終わりになります。 これからも、あなたの暗号通貨ライフが 良いものであることをラクーンはお祈りしています。
th: ขอบคุณที่ใช้แรคคูนเสมอนะ บทเรียนด้านความปลอดภัยจะเสร็จแล้ว ขอให้คุณโชคดี

# lesson_expert_message
source: Good day! You want to do back up Private Key, right? You can check your Private Key from the next screen. Thank you for staying loyal with us.
ja: こんにちは。 バックアップですね？ 次の画面から秘密鍵を確認できますよ。 いつもありがとうございます。
th: สวัสดี สำรองข้อมูลใช่ไหม คุณสามารถตรวจสอบ Private Key ได้จากหน้าจอถัดไป ขอบคุณนะ

# lesson_cancel_pin_title
source: Oops!
ja: おっと！
th: อ๊ะ!

# lesson_cancel_pin_message
source: It seems you have already set up PIN. Please press OK to complete lesson. Thank you!
ja: もうPINは設定してあるみたいですね。 OKを押してレッスンを終えてもらって大丈夫ですよ。 お疲れ様でした！
th: คุณได้ตั้งค่า PIN แล้ว กรุณา กดOK เพื่อไปหน้าต่อไป ขอบคุณนะ !

# lesson_pin_end_message
source: Now that you have done setup PIN. This may be the last lesson to you. You might as well want to set up fingerprint and/or face authentication. Do you want to proceed?
ja: PIN設定ができたみたいですね。 さてレッスンもこれで最後です。 実は合わせて生体認証でアプリにアクセスできるように設定できるのですが、ここで設定しておきますか？
th: ดูเหมือนว่าคุณสามารถตั้ง PIN ได้แล้ว บทเรียนสุดท้ายแล้วจริงๆนะ คุณสามารถตั้งค่าลายนิ้วมือเพื่อเข้าใช้แอพด้วยนะ ตั้งค่าไว้ตอนนี้หรือไม่?

# lesson_pin_end_set_ok
source: Set fingerprint authentication
ja: 生体認証を設定する
th: ตั้งค่าการตรวจสอบลายนิ้วมือ

# lesson_pin_end_home
source: Complete Lesson
ja: レッスンを終える
th: จบบทเรียน

# lesson_pin_end_not_available_title
source: Oops!
ja: おっと！
th: อ๊ะ!

# lesson_pin_end_not_available_message
source: It seems you have not done with setup fingerprint authentication on your device. Do you want to continue with fingerprint setup on Android OS setting?
ja: 端末自体の%@が未設定のようです。 iOSの設定画面に移動して、%@の設定を開始しますか？
th: ดูเหมือนว่าการตรวจสอบลายนิ้วมือของในเครื่องคุณยังไม่ได้รับการตั้งค่า คุณต้อง การไปที่หน้าจอการตั้งค่า iOS และเริ่มต้นตั้งค่าการตรวจสอบลายนิ้วมือไหม

# qrlab_amount_headline
source: Request payment
ja: 指定金額を受けとる
th: ระบุจำนวนเงินที่รับ

# qrlab_list_headline
source: Use Selling Item list
ja: 売り物リスト機能を使う
th: ใช้รายการผู้ขาย

# qrlab_register_headline
source: QR Register
ja: QRレジスター
th: ลงทะเบียน QR

# qrlab_register_description
source: Create QR invoice with total amount by scanning a code.
ja: 対応コードをスキャンして、合計金額を請求するQRコードを生成する
th: สแกนโค้ด เพื่อสร้าง QR โค้ดเรียกเก็บเงิน

# qrlab_amount_title
source: Amount
ja: 金額の指定
th: กำหนดจำนวนเงิน

# send_destination
source: Destination
ja: 送信先
th: ส่งไปยัง

# send_input_address
source: Enter destination address
ja: 送信先アドレスを入力
th: ใส่ Address ผู้รับ

# send_newbie_caution_title
source: Hey, Watch out!
ja: おっと、気をつけて。
th: โปรดระวังด้วย

# send_newbie_caution_message
source: You are about to send some crypto to the newbie address that has never run on Blockchain before. That said, please be assured that it is still legit address and therefore you can transfer cryptocurrency. In the next time, please check whether the address is correct or not, as much as you need to double check whether the recipient is reliable or not.
ja: あなたが送ろうとしているアドレスは、これまで一度もブロックチェーン上で活動していない初心者のようです。とはいえアドレスがちゃんとした形式なら送金は可能ですから、ご安心ください。 アドレスは正しいか、送り先は信頼できるか、よく確かめてから手続きしてくださいね。
th: Address ที่คุณกำลังพยายามส่งดูเหมือนจะเป็น Address ที่ไม่เคยใช้งานมาก่อน อย่างไรก็ตามการโอนเงินเป็นไปได้ถ้า Address ถูกต้อง โปรดตรวจสอบให้แน่ใจว่า Address ถูกต้องและปลายทางน่าเชื่อถือก่อนดำเนินรายการ

# send_amount_title
source: Enter amount
ja: 金額を入力
th: ใส่ตัวเลขจำนวนเงิน

# send_amount_setting
source: Remit processing
ja: 送金操作
th: ทำรายการโอนเงิน

# send_mosaic_setting
source: Attach Mosaic
ja: モザイク添付
th: แนบ mosaic

# send_mode_select_title
source: Select transfer mode
ja: 送信モードを選んでください
th: โปรดเลือกประเภทการส่ง

# send_mode_select_message
source: Do you want to send with a message?
ja: メッセージを添付しますか？
th: คุณต้องการแนบ Message หรือไม่?

# send_mode_attach
source: Attach
ja: 添付する
th: แนบ

# send_confirmation_title
source: This is the final remittance confirmation screen
ja: 送金の最終確認画面です
th: ยืนยันการโอนเงินครั้งสุดท้าย กรุณาตรวจสอบอย่างละเอียด

# send_confirmation_button
source: Show PIN on screen
ja: タップして認証画面を表示
th: แสดงรหัส PIN

# send_confirmation_biometrics
source: Confirm sending by fingerprint authentication
ja: %@で送金します
th: โอนเงินโดยการตรวจสอบลายนิ้วมือ

# send_confirmation_dialog_message
source: Authenticate by fingerprint or PIN to complete sending. Please check information carefully before authenticating.
ja: この画面で%@またはPINの認証が完了すると、送金が完了します。 表示された情報をよくご確認の上、操作してください。
th: เมื่อยืนยันการโอนเงินครั้งสุดท้ายด้วยการตรวจสอบลายนิ้วมือหรือการตรวจสอบรหัส PIN แล้ว จะถือว่ารายการโอนเงินนี้เสร็จสิ้น กรุณาตรวจสอบอย่างละเอียดก่อนที่คุณจะดำเนินรายการ

# send_confirmation_pin_message
source: Input PIN to confirm your transfer
ja: PINを入力して送金を確定する
th: ใส่รหัส PIN เพื่อยืนยันโอนเงิน

# send_complete_message
source: Your transfer request has been completed.
ja: 送金手続きが完了しました
th: กระบวนการโอนเสร็จสิ้น

# send_complete_transaction_label
source: Transfer detail
ja: 送金詳細
th: รายละเอียดโอนเงิน

# send_amount_with_xem
source: Send with XEM
ja: XEMを一緒に送る
th: ส่งพร้อมกับ XEM ด้วย

# send_message_type_select_title
source: Encrypt the message
ja: メッセージの暗号化設定
th: ตั้งค่าเข้ารหัส Message

# send_message_plain_title
source: Plain Message
ja: 通常のメッセージ
th: Message ธรรมดา

# send_message_plain_description
source: Plain message. Be sure to input authentication code here when you depositing in crypto exchanges.
ja: 通常のメッセージです。 取引所への認証番号を入力する際は、必ずこちらで行いましょう。
th: คุณกำลังจะส่งเป็น Message ธรรมดา ถ้าคุณต้องการใส่รหัสหมายเลขยืนยันกับ เว็บซื้อขายคริปโต

# send_message_encrypted_title
source: Encrypted message
ja: 暗号化メッセージ
th: Message เข้ารหัส

# send_message_encrypted_description
source: Let's secure your privacy with military grade encryption.
ja: 軍事レベルの暗号化技術でプライバシーを確保しましょう。
th: มาทำข้อความเป็นส่วนตัวด้วยเทคโนโลยีการเข้ารหัสระดับทหารกันเถอะ

# send_message_no_public_key_title
source: The recipient can't receive an encrypted message.
ja: 送り先が暗号化メッセージに対応していません。
th: ปลายทางไม่สอดคล้องกับข้อความที่เข้ารหัส

# send_message_no_public_key_message
source: In order to send an encrypted message, the recipient needs to have their public key. Since the current recipient does not have their public key, you can't send the encrypted message.
ja: 暗号化メッセージを送るには、暗号化に必要な公開鍵と呼ばれるコードを送り先が所持している必要があります。 現在指定されている送り先は公開鍵を所持していないため、暗号化メッセージは送れません。
th: การส่งข้อความที่เข้ารหัสปลายทางต้องมีรหัสที่เรียกว่าคีย์สาธารณะ หรือ Public Key ข้อมูลที่ระบุไว้ตอนนี้ไม่มีคีย์สาธารณะดังนั้นคุณจึงไม่สามารถส่งข้อความที่เข้ารหัสได้

# setting_language_select
source: Select language
ja: 言語選択
th: เลือกภาษา

# setting_currency_select
source: Currency
ja: 通貨
th: สกุล

# setting_notification_setting
source: Notifications
ja: 通知設定
th: ตั้งค่าการแจ้งเตือน

# setting_change_password
source: Set up PIN Code
ja: PINコードの設定
th: ตั้งรหัส PIN

# setting_require_biometrics
source: Fingerprint required
ja: %@の要求
th: ขอลายนิ้วมือ

# setting_require_pin_on_launch
source: Require PIN at startup
ja: 起動時にPIN入力を要求する
th: ขอรหัส PIN เพื่อดำเนินการต่อ

# setting_go_to_security_lesson
source: Take Security Lesson
ja: セキュリティレッスンを受ける
th: ชมบทเรียนด้านความปลอดภัย

# setting_node_select
source: Select node
ja: ノード選択
th: เลือก Node

# setting_pin_not_available_title
source: Oops!
ja: おっと!
th: อ๊ะ!

# setting_pin_not_available_message
source: Your PIN setup is uncompleted. Please set up your PIN first.
ja: PINの設定がまだのようですね。先にPINの設定をお願いできますか？
th: คุณยังไม่ได้ตั้งค่า PIN คุณสามารถตั้ง PIN ได้ตอนนี้หรือไม่?

# transaction_list_title
source: Transactions
ja: トランザクション一覧
th: รายการธุรกรรม

# transaction_detail_title
source: Transaction detail
ja: トランザクション詳細
th: รายละเอียดธุรกรรม

# transaction_no_transaction_title
source: Oops! No transaction yet.
ja: おっと、まだ取引はないようです。
th: ยังไม่ได้ทำรายการ

# transaction_no_transaction_message
source: All transactions will be shown here.
ja: トランザクションが発生したら、 ここに一覧で表示されます。
th: เมื่อเกิดมีการทำธุรกรรม จะปรากฏที่นี่

# transaction_message_is_encrypted
source: Message is encrypted
ja: メッセージは暗号化されています
th: Message ถูกเข้ารหัส

# transaction_failed_to_decrypt
source: Failed to unlock
ja: 解除に失敗しました
th: ไม่สามารถเผยแพร่ได้

# wallet_select
source: Select a wallet
ja: ウォレットを選択
th: เลือก Wallet

# wallet_creation_new
source: Create new wallet
ja: 新しくウォレットを作る
th: ทำกระเป๋าสตางค์หรือ Wallet ใหม่

# wallet_not_select_message
source: No wallet is selected
ja: ウォレットが選択されていません
th: คุณยังไม่ได้เลือก Wallet

# wallet_no_wallet_title
source: There is no wallet.
ja: ウォレットがありません。
th: ไม่มี Wallet

# wallet_no_wallet_message
source: The list of wallet(s) will be shown here when creating a new wallet by tapping above or linking your existing wallet account.
ja: 上のボタンからウォレットを作成するか アカウントをリンクすると、ここに一覧で表示されます。
th: สร้าง Wallet จากปุ่มด้านบน หรือลิงค์บัญชีของคุณเพื่อแสดงที่นี่

# wallet_creation_type_new
source: Create new wallet
ja: 新しくウォレットを作る
th: ทำกระเป๋าสตางค์หรือ Wallet ใหม่

# wallet_creation_type_import
source: Import
ja: インポート
th: Import หรือ ลิงค์ Wallet

# wallet_name_message
source: So, you chose to create a new wallet! Let us guide you how to create it! First of all, please name your wallet. Any name is fine as you wish.
ja: ウォレットの新規作成ですね！ それでは早速、あなたのウォレットを作っていきましょう。 まず最初にウォレットに名前をつけてください。 決まりはないので、お好きなもので大丈夫ですよ。
th: คุณเลือกสร้าง Wallet ใหม่! โปรดระบุชื่อ Wallet เป็นอันดับแรก ไม่มีข้อจำกัดการตั้งชื่อ ตั้งชื่อได้ตามที่ชอบเลยนะ

# wallet_name_input
source: Wallet name
th: ชื่อ Wallet

# wallet_create_message_0
source: Congratulations! Now that your Wallet has been created. Please see your address below.
ja: おめでとうございます！ ウォレットの作成が完了しました。 あなたのアドレスは以下になります。
th: ขอแสดงความยินดีด้วย! การสร้าง Wallet เสร็จสมบูรณ์แล้ว Address ของคุณจะอยู่ด้านล่าง
